# -*- mode: org; fill-column: 78; -*-
# Time-stamp: <2025-06-14 00:25:27 krylon>
#
#+TAGS: internals(i) ui(u) bug(b) feature(f)
#+TAGS: database(d) design(e), meditation(m)
#+TAGS: optimize(o) refactor(r) cleanup(c)
#+TODO: TODO(t)  RESEARCH(r) IMPLEMENT(i) TEST(e) | DONE(d) FAILED(f) CANCELLED(c)
#+TODO: MEDITATE(m) PLANNING(p) | SUSPENDED(s)
#+PRIORITIES: A G D

* PyKuang [0/1]
  :PROPERTIES:
  :COOKIE_DATA: todo recursive
  :VISIBILITY: children
  :END:
  A randomized portscanner, sort of.
** Clocktable
   #+BEGIN: clocktable :scope file :maxlevel 255 :emphasize t
   #+CAPTION: Clock summary at [2025-06-14 Sa 00:25]
   | Headline                  | Time    |         |       |
   |---------------------------+---------+---------+-------|
   | *Total time*              | *23:26* |         |       |
   |---------------------------+---------+---------+-------|
   | *PyKuang [0/1]*           | *23:26* |         |       |
   | \_  /Components [0/1]/    |         | /23:26/ |       |
   | \_    Configuration [0/0] |         |         |  0:25 |
   | \_    Model [0/0]         |         |         |  0:31 |
   | \_    Generator [0/0]     |         |         |  6:25 |
   | \_    Blacklist [0/0]     |         |         | 10:29 |
   | \_    Database [0/0]      |         |         |  1:29 |
   | \_    XFR [0/1]           |         |         |  4:07 |
   #+END:
** Journal
** Features [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
** Components [0/1]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
*** Configuration [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2025-06-11 Mi 18:15]--[2025-06-11 Mi 18:40] =>  0:25
    :END:
*** Model [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2025-06-07 Sa 15:20]--[2025-06-07 Sa 15:51] =>  0:31
    :END:
*** Generator [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2025-06-12 Do 16:57]--[2025-06-12 Do 17:28] =>  0:31
    CLOCK: [2025-06-11 Mi 18:55]--[2025-06-11 Mi 23:44] =>  4:49
    CLOCK: [2025-06-11 Mi 17:48]--[2025-06-11 Mi 18:14] =>  0:26
    CLOCK: [2025-06-10 Di 17:43]--[2025-06-10 Di 18:22] =>  0:39
    :END:
*** Blacklist [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2025-06-10 Di 18:34]--[2025-06-10 Di 23:02] =>  4:28
    CLOCK: [2025-06-10 Di 17:05]--[2025-06-10 Di 17:43] =>  0:38
    CLOCK: [2025-06-09 Mo 20:55]--[2025-06-09 Mo 21:47] =>  0:52
    CLOCK: [2025-06-09 Mo 18:20]--[2025-06-09 Mo 20:49] =>  2:29
    CLOCK: [2025-06-09 Mo 15:48]--[2025-06-09 Mo 16:50] =>  1:02
    CLOCK: [2025-06-08 So 16:54]--[2025-06-08 So 17:54] =>  1:00
    :END:
*** Database [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2025-06-12 Do 17:28]--[2025-06-12 Do 18:02] =>  0:34
    CLOCK: [2025-06-12 Do 16:31]--[2025-06-12 Do 16:43] =>  0:12
    CLOCK: [2025-06-07 Sa 15:51]--[2025-06-07 Sa 16:34] =>  0:43
    :END:
*** XFR [0/1]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2025-06-13 Fr 20:36]--[2025-06-14 Sa 00:23] =>  3:47
    CLOCK: [2025-06-12 Do 18:02]--[2025-06-12 Do 18:22] =>  0:20
    :END:
**** TODO Blacklist!
     When performing zone transfers, I need to check any host names and IP
     addresses against my blacklists before adding them to the database!
*** Scanner [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
** Bugs
